/*---------------------------------------------------------
 * 中华人民共和国行政区划代码（GB/T2260—999）
 * Usage : 
 * 1、nativePlace(32,'s');  // return '江苏省'(简体)
 * 2、 nativePlace(32,'t');  // return '江蘇省'(繁体)
 * Create by TerryWang 2011-9-19
 ---------------------------------------------------------*/
(function(){
	var _nativePlace = {
		11 : {s:'北京市', t:'北京市'},
		12 : {s:'天津市', t:'天津市'},
		13 : {s:'河北省', t:'河北省'},
		14 : {s:'山西省', t:'山西省'},
		15 : {s:'内蒙古自治区', t:'內蒙古自治區'},
		
		21 : {s:'辽宁省', t:'遼寧省'},
		22 : {s:'吉林省', t:'吉林省'},
		23 : {s:'黑龙江省', t:'黑龍江省'},
		
		31 : {s:'上海市', t:'上海市'},
		32 : {s:'江苏省', t:'江蘇省'},
		33 : {s:'浙江省', t:'浙江省'},
		34 : {s:'安徽省', t:'安徽省'},
		35 : {s:'福建省', t:'福建省'},
		36 : {s:'江西省', t:'江西省'},
		37 : {s:'山东省', t:'山東省'},
		
		41 : {s:'河南省', t:'河南省'},
		42 : {s:'湖北省', t:'湖北省'},
		43 : {s:'湖南省', t:'湖南省'},
		44 : {s:'广东省', t:'廣東省'},
		45 : {s:'广西壮族自治区', t:'廣西壯族自治區'},
		46 : {s:'海南省', t:'海南省'},
		
		50 : {s:'重庆市', t:'重慶市'},
		51 : {s:'四川省', t:'四川省'},
		52 : {s:'贵州省', t:'貴州省'},
		53 : {s:'云南省', t:'雲南省'},
		54 : {s:'西藏自治区', t:'西藏自治區'},
		
		61 : {s:'陕西省', t:'陝西省'},
		62 : {s:'甘肃省', t:'甘肅省'},
		63 : {s:'青海省', t:'青海省'},
		64 : {s:'宁夏回族自治区', t:'寧夏回族自治區'},
		65 : {s:'新疆维吾尔自治区', t:'新疆維吾爾自治區'}
	};
	var nativePlace = window.nativePlace = function(code,type){
		var origin = _nativePlace[code][type];
		if(origin){
			return origin;
		}else{
			return '未知地区';
		}
	} 
})();
